In [1]:
# Importing Pandas
import pandas as pd
import numpy as np

In [2]:
# Create a DataFrame from the given data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Bob'],
    'Age': [np.NaN, 30, 22, 35, 28],
    'City': ['Boston', 'San Francisco', 'Los Angeles', 'Chicago', 'Boston'],
    'Salary': [50000, 70000, 60000, 80000, 55000]
}

df = pd.DataFrame(data)

In [3]:
# 1. Display the first 3 rows of the DataFrame
first_3_rows = df.head(6)
print("1. Display the first 3 rows of the DataFrame:\n", first_3_rows)

1. Display the first 3 rows of the DataFrame:
       Name   Age           City  Salary
0    Alice   NaN         Boston   50000
1      Bob  30.0  San Francisco   70000
2  Charlie  22.0    Los Angeles   60000
3    David  35.0        Chicago   80000
4      Bob  28.0         Boston   55000

In [4]:
# 2. Find the number of rows and columns in the DataFrame
shape_of_df = df.shape
print("2. Find the number of rows and columns in the DataFrame:\n", shape_of_df)

2. Find the number of rows and columns in the DataFrame:
 (5, 4)

In [5]:
# 3. Display the unique values in the 'City' column
unique_cities = df['City'].unique()
print("3. Display the unique values in the 'City' column:\n", unique_cities)

3. Display the unique values in the 'City' column:
 ['Boston' 'San Francisco' 'Los Angeles' 'Chicago']

In [6]:
# 4. Calculate the mean salary of the employees
mean_salary = df['Salary'].mean()
print("4. Calculate the mean salary of the employees:\n", mean_salary)

4. Calculate the mean salary of the employees:
 63000.0

In [7]:
# 5. Add a new column 'Bonus' with random bonus values (e.g., 1000, 1500, 1200, 2000, 1100)
df['Bonus'] = [100, 200, 300, 400, 500]
print("5. Add a new column 'Bonus' with random bonus values:\n", df)

5. Add a new column 'Bonus' with random bonus values:
       Name   Age           City  Salary  Bonus
0    Alice   NaN         Boston   50000    100
1      Bob  30.0  San Francisco   70000    200
2  Charlie  22.0    Los Angeles   60000    300
3    David  35.0        Chicago   80000    400
4      Bob  28.0         Boston   55000    500

In [8]:
# 6. Drop the 'City' column from the DataFrame
df_without_city = df.drop('City', axis=1)
print("6. Drop the 'City' column from the DataFrame:\n", df_without_city)

6. Drop the 'City' column from the DataFrame:
       Name   Age  Salary  Bonus
0    Alice   NaN   50000    100
1      Bob  30.0   70000    200
2  Charlie  22.0   60000    300
3    David  35.0   80000    400
4      Bob  28.0   55000    500

In [9]:
# 7. Select only the rows where the age is greater than 25
above_25_years = df[df['Age'] > 25]
print("7. Select only the rows where the age is greater than 25:\n", above_25_years)

7. Select only the rows where the age is greater than 25:
     Name   Age           City  Salary  Bonus
1    Bob  30.0  San Francisco   70000    200
3  David  35.0        Chicago   80000    400
4    Bob  28.0         Boston   55000    500

In [10]:
# 8. Set the 'Name' column as the index of the DataFrame
df_with_index = df.set_index('Name')
print("8. Set the 'Name' column as the index of the DataFrame:\n", df_with_index)

8. Set the 'Name' column as the index of the DataFrame:
           Age           City  Salary  Bonus
Name
Alice     NaN         Boston   50000    100
Bob      30.0  San Francisco   70000    200
Charlie  22.0    Los Angeles   60000    300
David    35.0        Chicago   80000    400
Bob      28.0         Boston   55000    500

In [11]:
df_with_index.loc["Bob"]["Age"]

Name
Bob    30.0
Bob    28.0
Name: Age, dtype: float64

In [12]:
# 9. Reset the index of the DataFrame
df_reset_index = df_with_index.reset_index()
print("9. Reset the index of the DataFrame:\n", df_reset_index)

9. Reset the index of the DataFrame:
       Name   Age           City  Salary  Bonus
0    Alice   NaN         Boston   50000    100
1      Bob  30.0  San Francisco   70000    200
2  Charlie  22.0    Los Angeles   60000    300
3    David  35.0        Chicago   80000    400
4      Bob  28.0         Boston   55000    500

In [13]:
# 10. Sort the DataFrame based on the 'Salary' column in descending order
sorted_df = df.sort_values('Salary', ascending=False)
print("10. Sort the DataFrame based on the 'Salary' column in descending order:\n", sorted_df)

10. Sort the DataFrame based on the 'Salary' column in descending order:
       Name   Age           City  Salary  Bonus
3    David  35.0        Chicago   80000    400
1      Bob  30.0  San Francisco   70000    200
2  Charlie  22.0    Los Angeles   60000    300
4      Bob  28.0         Boston   55000    500
0    Alice   NaN         Boston   50000    100

In [14]:
# 11. Group the DataFrame by the 'City' column and calculate the mean salary in each city
mean_salary_by_city = df.groupby('City')['Salary'].mean()
print("11. Group the DataFrame by the 'City' column and calculate the mean salary in each city:\n", mean_salary_by_city)

11. Group the DataFrame by the 'City' column and calculate the mean salary in each city:
 City
Boston           52500.0
Chicago          80000.0
Los Angeles      60000.0
San Francisco    70000.0
Name: Salary, dtype: float64

In [15]:
# 12. Replace 'Charlie' with 'Eva' in the 'Name' column
df_replace_name = df['Name'].replace('Charlie', 'Eva')
print("12. Replace 'Charlie' with 'Eva' in the 'Name' column:\n", df_replace_name)

12. Replace 'Charlie' with 'Eva' in the 'Name' column:
 0    Alice
1      Bob
2      Eva
3    David
4      Bob
Name: Name, dtype: object

In [16]:
# 13. Display the statistical summary of the DataFrame
summary_stats = df.describe()
print("13. Display the statistical summary of the DataFrame:\n", summary_stats)

13. Display the statistical summary of the DataFrame:
              Age        Salary       Bonus
count   4.000000      5.000000    5.000000
mean   28.750000  63000.000000  300.000000
std     5.377422  12041.594579  158.113883
min    22.000000  50000.000000  100.000000
25%    26.500000  55000.000000  200.000000
50%    29.000000  60000.000000  300.000000
75%    31.250000  70000.000000  400.000000
max    35.000000  80000.000000  500.000000

In [17]:
# 14. Fill missing values in the DataFrame with the mean of each column
df_filled_na = df.fillna(0)
# df_filled_na = df.fillna(df.mean())
print("14. Fill missing values in the DataFrame with the mean of each column:\n", df_filled_na)

14. Fill missing values in the DataFrame with the mean of each column:
       Name   Age           City  Salary  Bonus
0    Alice   0.0         Boston   50000    100
1      Bob  30.0  San Francisco   70000    200
2  Charlie  22.0    Los Angeles   60000    300
3    David  35.0        Chicago   80000    400
4      Bob  28.0         Boston   55000    500

In [18]:
# 15. Calculate the total salary expenditure by the company
total_salary_expenditure = df['Salary'].sum()
print("15. Calculate the total salary expenditure by the company:\n", total_salary_expenditure)

15. Calculate the total salary expenditure by the company:
 315000

In [19]:
# 16. Save the DataFrame to a CSV file named 'employee_data.csv'
df.to_csv('employee_data.csv', index=True)
print("16. Save the DataFrame to a CSV file named 'employee_data.csv': File saved.")

16. Save the DataFrame to a CSV file named 'employee_data.csv': File saved.

In [20]:
# 17. Read the 'employee_data.csv' file into a new DataFrame
new_df = pd.read_csv('employee_data.csv')
print("17. Read the 'employee_data.csv' file into a new DataFrame:\n", new_df)

17. Read the 'employee_data.csv' file into a new DataFrame:
    Unnamed: 0     Name   Age           City  Salary  Bonus
0           0    Alice   NaN         Boston   50000    100
1           1      Bob  30.0  San Francisco   70000    200
2           2  Charlie  22.0    Los Angeles   60000    300
3           3    David  35.0        Chicago   80000    400
4           4      Bob  28.0         Boston   55000    500

In [21]:
# 18. Display the last 2 rows of the new DataFrame
last_2_rows_new_df = new_df.tail(2)
print("18. Display the last 2 rows of the new DataFrame:\n", last_2_rows_new_df)

18. Display the last 2 rows of the new DataFrame:
    Unnamed: 0   Name   Age     City  Salary  Bonus
3           3  David  35.0  Chicago   80000    400
4           4    Bob  28.0   Boston   55000    500

In [22]:
print(df)

      Name   Age           City  Salary  Bonus
0    Alice   NaN         Boston   50000    100
1      Bob  30.0  San Francisco   70000    200
2  Charlie  22.0    Los Angeles   60000    300
3    David  35.0        Chicago   80000    400
4      Bob  28.0         Boston   55000    500

In [23]:
# 19. Rename the columns to 'EmployeeName', 'EmployeeAge', 'EmployeeCity', 'EmployeeSalary'
df_renamed_columns = df
df_renamed_columns.columns = ['EmployeeName', 'EmployeeAge', 'EmployeeCity', 'EmployeeSalary', 'EmployeeBonus']
print("19. Rename the columns to 'EmployeeName', 'EmployeeAge', 'EmployeeCity', 'EmployeeSalary':\n", df_renamed_columns)

19. Rename the columns to 'EmployeeName', 'EmployeeAge', 'EmployeeCity', 'EmployeeSalary':
   EmployeeName  EmployeeAge   EmployeeCity  EmployeeSalary  EmployeeBonus
0        Alice          NaN         Boston           50000            100
1          Bob         30.0  San Francisco           70000            200
2      Charlie         22.0    Los Angeles           60000            300
3        David         35.0        Chicago           80000            400
4          Bob         28.0         Boston           55000            500

In [24]:
# 20. Create a new DataFrame with only 'Name' and 'Salary' columns
df_name_salary = df[['EmployeeName', 'EmployeeSalary']]
print("20. Create a new DataFrame with only 'Name' and 'Salary' columns:\n", df_name_salary)

20. Create a new DataFrame with only 'Name' and 'Salary' columns:
   EmployeeName  EmployeeSalary
0        Alice           50000
1          Bob           70000
2      Charlie           60000
3        David           80000
4          Bob           55000